example/NEW_piso/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o., Tue Sep  6 06:24:23 2016               |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

k 30;
l 60;

convertToMeters 0.1;

vertices        
(
    (0.5 	0 		-0.5)		//0
    (1.0 	0 		-0.5)		//1
    (10 		0 	-0.5)		//2
    (10 		0.707107 -0.5)		//3
    (0.707107 	0.707107 	-0.5)		//4
    (0.353553 	0.353553 	-0.5)		//5
    (10 		5 	-0.5)		//6
    (0.707107 	5 		-0.5)		//7
    (0 		5 		-0.5)		//8
    (0 		1 		-0.5)		//9
    (0 		0.5 		-0.5)		//10
    (-0.5 	0 		-0.5)		//11
    (-1 	0 		-0.5)		//12
    (-5 	0 		-0.5)		//13
    (-5		0.707107 	-0.5)		//14
    (-0.707107 	0.707107 	-0.5)		//15
    (-0.353553 	0.353553 	-0.5)		//16
    (-5 	5 		-0.5)		//17
    (-0.707107 	5 		-0.5)		//18
    (0.5 	0 		0.5)			//19
    (1.0 	0 		0.5)			//20
    (10 		0 		0.5)			//21
    (10 		0.707107 	0.5)			//22
    (0.707107 	0.707107 	0.5)			//23
    (0.353553 	0.353553 	0.5)			//24
    (10 		5 		0.5)			//25
    (0.707107 	5 		0.5)			//26
    (0 		5 		0.5)			//27
    (0 		1 		0.5)			//28
    (0 		0.5 		0.5)			//29
    (-0.5 	0		0.5)			//30
    (-1 	0 		0.5)			//31
    (-5 	0 		0.5)			//32
    (-5 	0.707107 	0.5)			//33
    (-0.707107 	0.707107 	0.5)			//34
    (-0.353553 	0.353553 	0.5)			//35
    (-5 	5 		0.5)			//36
    (-0.707107 	5 		0.5)			//37
    (10 		-0.707107 	-0.5)		//38
    (0.707107 	-0.707107 	-0.5)		//39
    (0.353553 	-0.353553 	-0.5)		//40
    (10 		-5 		-0.5)		//41
    (0.707107 	-5 		-0.5)		//42
    (0 		-5 		-0.5)		//43
    (0 		-1 		-0.5)		//44
    (0 		-0.5 		-0.5)		//45	
    (-5		-0.707107 	-0.5)		//46
    (-0.707107 	-0.707107 	-0.5)		//47
    (-0.353553 	-0.353553 	-0.5)		//48
    (-5 	-5 		-0.5)		//49
    (-0.707107 	-5 		-0.5)		//50	
    (10 		-0.707107 	0.5)			//51
    (0.707107 	-0.707107 	0.5)			//52
    (0.353553 	-0.353553 	0.5)			//53	
    (10 		-5 		0.5)			//54
    (0.707107 	-5 		0.5)			//55
    (0 		-5 		0.5)			//56
    (0 		-1 		0.5)			//57
    (0 		-0.5 		0.5)			//58
    (-5 	-0.707107 	0.5)			//59
    (-0.707107 	-0.707107	0.5)			//60
    (-0.353553 	-0.353553	0.5)			//61
    (-5 	-5 		0.5)			//62
    (-0.707107 	-5 		0.5)  		//63
);

blocks          
(
     hex (0 1 4 5 19 20 23 24) ($k $k 1) simpleGrading (5 1 1)
     hex (5 4 9 10 24 23 28 29) ($k $k 1) simpleGrading (5 1 1)
     hex (1 2 3 4 20 21 22 23) ($l $k 1) simpleGrading (10 1 1) 
     hex (4 3 6 7 23 22 25 26) ($l $l 1) simpleGrading (10 1 1)
     hex (9 4 7 8 28 23 26 27) ($k $l 1) simpleGrading (1 1 1)
 
       hex (15 16 10 9 34 35 29 28) ($k $k 1) simpleGrading (0.2 1 1)
       hex (12 11 16 15 31 30 35 34) ($k $k 1) simpleGrading (0.2 1 1)
       hex (13 12 15 14 32 31 34 33) ($l $k 1) simpleGrading (0.1 1 1)
       hex (14 15 18 17 33 34 37 36) ($l $l 1) simpleGrading (0.1 1 1)
       hex (15 9 8 18 34 28 27 37) ($k $l 1) simpleGrading (1 1 1)
 
       hex (44 39 40 45 57 52 53 58) ($k $k 1) simpleGrading (1 0.2 1)
       hex (39 1 0 40 52 20 19 53) ($k $k 1) simpleGrading (1 0.2 1)
       hex (38 2 1 39 51 21 20 52) ($k $l 1) simpleGrading (1 0.1 1) 
       hex (42 41 38 39 55 54 51 52) ($l $l 1) simpleGrading (10 1 1)
       hex (43 42 39 44 56 55 52 57) ($k $l 1) simpleGrading (1 1 1)
 
        hex (47 44 45 48 60 57 58 61) ($k $k 1) simpleGrading (1 0.2 1)
        hex (12 47 48 11 31 60 61 30) ($k $k 1) simpleGrading (1 0.2 1)
       hex (13 46 47 12 32 59 60 31) ($k $l 1) simpleGrading (1 0.1 1) 
       hex (49 50 47 46 62 63 60 59) ($l $l 1) simpleGrading (0.1 1 1)
        hex (50 43 44 47 63 56 57 60) ($k $l 1) simpleGrading (1 1 1)
);

edges           
(
    arc 0 5 (0.469846 0.17101 -0.5)
    arc 5 10 (0.17101 0.469846 -0.5)
    arc 1 4 (0.939693 0.34202 -0.5)
    arc 4 9 (0.34202 0.939693 -0.5)
    arc 19 24 (0.469846 0.17101 0.5)
    arc 24 29 (0.17101 0.469846 0.5)
    arc 20 23 (0.939693 0.34202 0.5)
    arc 23 28 (0.34202 0.939693 0.5)
    arc 11 16 (-0.469846 0.17101 -0.5)
    arc 16 10 (-0.17101 0.469846 -0.5)
    arc 12 15 (-0.939693 0.34202 -0.5)
    arc 15 9 (-0.34202 0.939693 -0.5)
    arc 30 35 (-0.469846 0.17101 0.5)
    arc 35 29 (-0.17101 0.469846 0.5)
    arc 31 34 (-0.939693 0.34202 0.5)
    arc 34 28 (-0.34202 0.939693 0.5)
    arc 0 40 (0.469846 -0.17101 -0.5)
    arc 40 45 (0.17101 -0.469846 -0.5)
    arc 1 39 (0.939693 -0.34202 -0.5)
    arc 39 44 (0.34202 -0.939693 -0.5)
    arc 19 53 (0.469846 -0.17101 0.5)
    arc 53 58 (0.17101 -0.469846 0.5)
    arc 20 52 (0.939693 -0.34202 0.5)
    arc 52 57 (0.34202 -0.939693 0.5)
    arc 11 48 (-0.469846 -0.17101 -0.5)
    arc 48 45 (-0.17101 -0.469846 -0.5)
    arc 12 47 (-0.939693 -0.34202 -0.5)
    arc 47 44 (-0.34202 -0.939693 -0.5)
    arc 30 61 (-0.469846 -0.17101 0.5)
    arc 61 58 (-0.17101 -0.469846 0.5)
    arc 31 60 (-0.939693 -0.34202 0.5)
    arc 60 57 (-0.34202 -0.939693 0.5)
);

 boundary         
 (
    down 
    {
	type symmetryPlane;
	faces
	(
        (42 43 56 55)
        (41 42 55 54)
        (43 50 63 56)
        (50 49 62 63)
	);
    }
    OUTLET
    {
    type patch; 
    faces
    (
        (2 3 22 21)
        (3 6 25 22)
        (2 38 51 21)
        (38 41 54 51)
    );
    }
    up 
    {
	type symmetryPlane;
	faces
	(
        (7 8 27 26)
        (6 7 26 25)
        (8 18 37 27)
        (18 17 36 37)
	);
    }
    INLET
    {
    type patch; 
    faces
    (
        (14 13 32 33)
        (17 14 33 36)
        (46 13 32 59)
        (49 46 59 62)
    );
    }
    wall
    {
    type wall;
    faces
    (
        (10 5 24 29)
        (5 0 19 24)
        (16 10 29 35)
        (11 16 35 30)
        (45 40 53 58)
        (40 0 19 53)
        (48 45 58 61)
        (11 48 61 30)
   );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //
